// -----------------------------------------------------------------
// Common AngularJS Plugin
// -----------------------------------------------------------------
// Yêu cậu khi import plugin:
//   + CTSAngular Plugin
// -----------------------------------------------------------------
'use strict';
// -----------------------------------------------------------------
// Định nghĩa module controllers
// -----------------------------------------------------------------
var ctrls = angular.module('controllers', []);
// -----------------------------------------------------------------
// Định nghĩa các module
// -----------------------------------------------------------------
var app = angular.module('app', [
    'cts.angular',
    'cts.ccs',
    'controllers',
    'treeControl'
]);
// -----------------------------------------------------------------
// Định nghĩa các config
// -----------------------------------------------------------------
app.config(function ($locationProvider) {
    $locationProvider.html5Mode({
        enabled: true,
        requireBase: false
    });
});